In [2]:
%load_ext sql

/root/anaconda3/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/root/anaconda3/lib/python3.6/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [3]:
%sql sqlite:///midtermtest.db

'Connected: None@midtermtest.db'

## 고객(client) 테이블 생성 SQL 문장

In [99]:
%%sql create table client (
        c_no int not null,
        c_name varchar(10),
        c_age int check (0<c_age<90),
        c_sex char(6) check (c_sex in ("male", "female")),
        c_grade char(6) check (c_grade in ("vip", "gold", "silver")),
        c_item char(10),
        c_saler int,
        c_fmon char(12),
        c_lmon char(12),
        primary key (c_no),
        constraint s_f_key foreign key (c_saler) references saler on update cascade,
        constraint i_f_key foreign key (c_item) references item on update cascade,
        constraint g_f_key foreign key (c_grade) references grade on update cascade
        );

3 rows affected.

[]

<hr/>

## 판매자(saler) 테이블 생성 SQL 문장

In [100]:
%%sql create table saler (
        s_no int not null,
        s_name varchar(10),
        s_payment int check (29999<s_payment),
        s_grade char(10) not null,
        primary key (s_no),
        constraint c_f_key foreign key (s_no) references client on update cascade on delete cascade
        );

3 rows affected.

[]

<hr/>

## 상품(item) 테이블 생성 SQL 문장

In [101]:
%%sql create table item (
        i_no int not null,
        i_name varchar(10),
        i_price int check (9<i_price),
        primary key (i_no),
        constraint c_f_key foreign key (i_no) references client on update cascade on delete cascade
        );

3 rows affected.

[]

<hr/>

## 등급(grade) 테이블 생성 SQL 문장

In [102]:
%%sql create table grade (
        g_grade char(6) unique,
        g_sale float(3) check(g_sale<0.11),
        primary key(g_grade),
        constraint c_f_key foreign key (g_grade) references client on update cascade on delete cascade
        );

3 rows affected.

[]

<hr/>

In [92]:
%sql update saler set s_grade = 'director' where s_grade='derector';

3 rows affected.

[]

<hr/>

# 1. 첫번 째 테이블 (client)

In [108]:
%sql select * from client;

Done.

[(1, 'johnson', 43, 'male', 'vip', '10', 100, '2010-08-01', '2020-07-30'),
 (2, 'catherin', 57, 'female', 'gold', '11', 202, '2017-10-01', '2027-09-31'),
 (3, 'rick', 25, 'male', 'gold', '20', 101, '2012-05-01', '2032-04-30'),
 (4, 'gordick', 65, 'male', 'vip', '21', 102, '2007-01-01', '2026-12-31'),
 (5, 'isabell', 10, 'female', 'silver', '40', 201, '2017-10-01', '2027-09-31'),
 (6, 'seyfried', 30, 'female', 'vip', '11', 302, '2015-02-01', '2035-01-30'),
 (7, 'murto', 52, 'male', 'gold', '10', 301, '2016-09-01', '2021-08-30'),
 (8, 'glen', 30, 'male', 'vip', '30', 103, '2012-06-01', '2022-05-31'),
 (9, 'decaprio', 50, 'male', 'vip', '11', 300, '2005-08-01', '2035-07-30'),
 (10, 'trump', 70, 'male', 'vip', '11', 200, '1990-03-01', '2030-02-28'),
 (11, 'busi', 77, 'male', 'vip', '21', 100, '1995-02-01', '2025-01-31'),
 (12, 'ioniq', 5, 'female', 'gold', '41', 103, '2016-05-01', '2026-04-30'),
 (13, 'messi', 30, 'male', 'vip', '31', 101, '2006-03-01', '2021-02-28'),
 (14, 'jordan', 40, 'male', 'silver', '50', 102, '2010-11-01', '2030-10-31'),
 (15, 'manson', 21, 'male', 'gold', '51', 200, '2014-03-01', '2024-02-28')]

1. 보험사 고객의 정보를 가진 데이터베이스이다. 고객번호, 이름, 나이, 성별, 등급, 상품번호, 판매자번호, 가입월, 만기월 총  9개의 어트리뷰트로 구성되어 있다.

2. 기본키는 고객번호(c_no) 이며, 외래키로 등급(c_grade), 상품번호(c_item), 판매자번호(c_saler) 3개를 두어 각각의 테이블이 위 테이블을 참조 할 수 있도록 하였다.

3. 어트리뷰트 제약조건으로 나이(c_age)어트리뷰트는 0세 ~ 90세, 성별(c_sex)어트리뷰트는 'male'과 'female'값을 가지는지 체크, 등급(c_grade)어트리뷰트는 'vip', 'gole'와 'silver'값을 가지는지 체크하도록 하였다.

# 2. 두번 째 테이블 (saler)

In [109]:
%sql select * from saler;

Done.

[(100, 'stark', 50000, 'director'),
 (101, 'cambell', 40000, 'manager'),
 (102, 'gotham', 30000, 'staff'),
 (103, 'lee', 30000, 'staff'),
 (200, 'jang', 50000, 'director'),
 (201, 'hathaway', 40000, 'manager'),
 (202, 'bradpitt', 30000, 'staff'),
 (300, 'obama', 50000, 'director'),
 (301, 'meilan', 40000, 'manager'),
 (302, 'victor', 30000, 'staff')]

1. 보험 판매자의 정보를 가지고 있는 데이터베이스이다. 판매자번호, 이름, 급여, 직급까지 4가지 어트리뷰트를 가지고 있다.

2. 기본키겸 외래키인 판매자번호(s_no)를 두어 다른 테이블이 이 테이블을 참조할 수 있도록 하였다. 

3. 어트리뷰트 제약조건으로 급여(s_payment)어트리뷰트의 값이 29999이상의 값을 가지는지 체크하도록 하였다.

# 3. 세번 째 테이블 (item)

In [110]:
%sql select * from item;

Done.

[(10, 'total', 15),
 (11, 'total_v', 30),
 (20, 'cancer', 40),
 (21, 'cancer_v', 60),
 (30, 'wound', 10),
 (31, 'wound_v', 30),
 (40, 'kid', 20),
 (41, 'kid_v', 40),
 (50, 'tooth', 80),
 (51, 'tooth_v', 99)]

1. 보험사에서 판매하는 상품의 정보를 가지고 있는 데이터베이스이다. 상품번호, 상품이름, 가격까지 3가지 어트리뷰트를 가지고있다.

2. 기본키겸 외래키인 상품번호(i_no)를 두어 다른 테이블이 이 테이블값을 참조할 수 있도록 하였다.

3. 어트리뷰트 제약조건으로 상품가격(i_price)어트리뷰트의 값이 10이상이 되는지 체크하도록 하였다.

# 4. 네번 째 테이블 (grade)

In [111]:
%sql select * from grade;

Done.

[('vip', 0.09), ('gold', 0.07), ('silver', 0.05)]

1. 할인등급에 따라 할인율 정보를 가지고 있는 데이터베이스이다. 할인등급, 할인율까지 2가지 어트리뷰트를 가지고 있다.

2. 기본키겸 외래키인 등급(g_grade)를 두어 다른 테이블이 이 테이블값을 참조할 수 있도록 하였다.

3. 어트리뷰트 제약조건으로 등급(g_grade)어트리뷰트가 유일한 값을 가지는지, 할인율이 0.1이하의 값을 가지는지 체크하도록 하였다.

## 테이블간 참조 상황 도식화

![tablechamjo](./dbimage/tablechamjo.jpg)

<hr/>

## 질의1. 판매자 번호 '100'번에게 상품을 구매한 고객들의 이름을 검색하라.

In [112]:
%sql select c_name from client where c_saler=100;

Done.

[('johnson',), ('busi',)]

##    테이블 도식화

![query1](./dbimage/query1.jpg)

## 관계형 대수식

R ← πc_name (σc_saler=100 (client))

<hr/>

## 질의2. 직급이 'manager'인 판매자에게 구입한 고객들의 이름을 검색하라.

In [117]:
%sql select s_name, s_grade, c_name from client c, saler s where s.s_grade='manager' and s.s_no = c.c_saler;

Done.

[('cambell', 'manager', 'rick'),
 ('hathaway', 'manager', 'isabell'),
 ('meilan', 'manager', 'murto'),
 ('cambell', 'manager', 'messi')]

## 테이블 도식화

![query2](./dbimage/query2.jpg)

## 관계형 대수식

R1 ← client⋈(c_saler=s_no) saler <br/>
R2 ← πc_name (σs_grade='manage' (R1))

<hr/>

## 질의3. 판매자 번호 '101'번인 판매자가 판매한 상품 종류를 검색하라.

In [121]:
%sql select c_name ,i_name from client, item where c_saler = 101 and i_no=c_item;

Done.

[('rick', 'cancer'), ('messi', 'wound_v')]

## 테이블 도식화

![query3](./dbimage/query3.jpg)

## 관계형 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← πi_name (σc_saler=101 (R1))

<hr/>

## 질의4. 판매자 번호 '103'번인 판매자에게 구매한 고객들의 등급을 검색하라.

In [265]:
%sql select c_grade from client where c_saler = 103;

Done.

[('vip',), ('gold',)]

## 테이블 도식화

![query4](./dbimage/query4.jpg)

## 관계형 대수식

R ← πc_grade (σc_saler=103 (client))

<hr/>

## 질의5. 직급이 'staff'인 판매자에게 구매한 '남성' 성별의 고객 수를 검색하라.

In [367]:
%sql select (count(c_sex='male')) as  male from client c, saler s where s.s_grade='staff' and c.c_saler = s.s_no and c.c_sex='male' ;

Done.

[(3,)]

## 테이블 도식화

![query5](./dbimage/query5.jpg)

## 관계형 대수식

R1 ← client⋈(c_saler=s_no) saler <br/>
R2 ← πc_sex (σs_grade='staff' (R1)) <br/>
R3 ← πR1='male' (R2) <br/>
R4 ← count(R3)

<hr/>

## 질의6. 이름이 'seyfried'인 고객이 구매한 상품명을 검색하라.

In [127]:
%sql select i_name from client, item where c_name='seyfried' and i_no=c_item;

Done.

[('total_v',)]

## 테이블 도식화

![query6](./dbimage/query6.jpg)

## 관계형 대수식

R1 ← client⋈ (c_item=i_no) item <br/>
R2 ← πi_name (σc_name='seyfreid' (R1))

<hr/>

## 질의7. 이름이'messi'인 고객이 구매한 상품 가격을 검색하라.

In [296]:
%sql select i_price from client c, item i where i.i_no = c.c_item and c.c_name='messi';

Done.

[(30,)]

## 테이블 도식화

![query7](./dbimage/query7.jpg)

## 관계형 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← πi_price (σc_name='messi' (R1))

<hr/>

## 질의8. 판매자 'hathaway'에게 구매한 고객의 이름을 검색하라.

In [129]:
%sql select c_name from client c, saler s where s.s_name='hathaway' and s.s_no = c.c_saler;

Done.

[('isabell',)]

## 테이블 도식화

![query88](./dbimage/query88.jpg)

## 관계형 대수식

R1 ← client⋈(c_item=s_no) saler <br/>
R2 ← πc_name (σs_name='hathaway' (R1))

<hr/>

## 질의9. 판매자 'gotham'에게 구매한 고객의 성별을 검색하라.

In [301]:
%sql select c_sex from client c, saler s where s.s_name='gotham' and s.s_no = c.c_saler;

Done.

[('male',), ('male',)]

## 테이블 도식화

![query99](./dbimage/query99.jpg)

## 관계형 대수식

R1 ← client⋈(c_saler=s_no) saler <br/>
R2 ← πc_sex (σs_name='gotham' (R1))

<hr/>

## 질의10. 판매자 번호 '200'번대의 판매자에게 상품을 구매한 고객들의 이름을 검색하라.

In [310]:
%sql select c_name from client where 199<c_saler and c_saler<300;

Done.

[('catherin',), ('isabell',), ('trump',), ('manson',)]

## 테이블 도식화

![query10](./dbimage/query10.jpg)

## 관계 대수식

R ← πc_name (σ(199<c_saler<300) (client))

<hr/>

## 질의11. 판매자 번호 '300'번대의 판매자에게 상품을 구매한 고객들의 나이를 검색하라.

In [312]:
%sql select c_age from client where 299<c_saler and c_saler<400;

Done.

[(30,), (52,), (50,)]

## 테이블 도식화

![query11](./dbimage/query11.jpg)

##  관계 대수식

R ← πc_age (σ(299<c_saler<400 (client))

<hr/>

## 질의12. 이름이 'm'으로 시작하는 고객의 정보를 검색하라.

In [322]:
%sql select * from client where c_name like "m%";

Done.

[(7, 'murto', 52, 'male', 'gold', '10', 301, '2016-09-01', '2021-08-30'),
 (13, 'messi', 30, 'male', 'vip', '31', 101, '2006-03-01', '2021-02-28'),
 (15, 'manson', 21, 'male', 'gold', '51', 200, '2014-03-01', '2024-02-28')]

## 테이블 도식화

![query12](./dbimage/query12.jpg)

## 관계 대수식

R ← σs_name='m%' (client))

<hr/>

## 질의13. 판매자 번호 '200'번인 판매자가 판매한 월매출을 검색하라.

In [134]:
%sql select sum(i_price) from client c, item i where c.c_saler='200' and c.c_item = i.i_no;

Done.

[(129,)]

## 테이블 도식화

![query13](./dbimage/query13.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← πi_price (σc_saler=200 (R1)) <br/>
R3 ← SUM(R2)

<hr/>

## 질의14. 고객의 등급에 맞게 할인된 상품 가격을 검색하라.

In [362]:
%sql select c_name, g_sale, i_price, ((1-g_sale)*i_price) as sale_price from client c, grade g, item i where g.g_grade=c.c_grade and i.i_no = c.c_item;

Done.

[('johnson', 0.09, 15, 13.65),
 ('catherin', 0.07, 30, 27.9),
 ('rick', 0.07, 40, 37.199999999999996),
 ('gordick', 0.09, 60, 54.6),
 ('isabell', 0.05, 20, 19.0),
 ('seyfried', 0.09, 30, 27.3),
 ('murto', 0.07, 15, 13.95),
 ('glen', 0.09, 10, 9.1),
 ('decaprio', 0.09, 30, 27.3),
 ('trump', 0.09, 30, 27.3),
 ('busi', 0.09, 60, 54.6),
 ('ioniq', 0.07, 40, 37.199999999999996),
 ('messi', 0.09, 30, 27.3),
 ('jordan', 0.05, 80, 76.0),
 ('manson', 0.07, 99, 92.07)]

## 테이블 도식화

![query14](./dbimage/query14.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← R1⋈(c_grade=g_grade) grade <br/>
R3 ← πi_price (R2) <br/>
R4 ← πg_sale (R2) <br/>
R5 ←  R3 * R4

<hr/>

## 질의15. 이름이 'g'로 시작하는 고객의 등급할인이 적용된 상품가격을 검색하라.

In [366]:
%sql select c_name ,((1-g_sale)*i_price) as sale_price from client c, item i, grade g where c.c_name like "g%" and c.c_item=i.i_no and g.g_grade=c.c_grade;

Done.

[('gordick', 54.6), ('glen', 9.1)]

## 테이블 도식화

![query15](./dbimage/query15.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← R1⋈(c_grade=g_grade) grade <br/>
R3 ← πc_name='g%' and πi_price (R2) <br/>
R4 ← πc_name='g%' and πg_sale (R2) <br/>
R5 ← R3 * R4

<hr/>

## 질의16. 판매자 'meilan'에게 구매한 고객들의 구매 개월 수를 검색하라.

In [136]:
%sql select s_name ,c_name ,(strftime('%Y', c_lmon, 'localtime')-strftime('%Y', c_fmon, 'localtime'))*12 as SALE from client c, saler s where s.s_name='meilan' and s.s_no = c.c_saler;

Done.

[('meilan', 'murto', 60)]

## 테이블 도식화

![query16](./dbimage/query16.jpg)

## 관계 대수식

R1 ← client⋈(c_item=s_no) saler <br/>
R2 ← πc_fmon (σs_name='meilan'(R1)) <br/>
R3 ← πc_lmon (σs_name='meilan'(R1)) <br/>
R4 ← R3 - R2

<hr/>

## 질의17. 등급이 'silver'인 고객들의 총 구매 개월 수를 검색하라.

In [137]:
%sql select c_name, (strftime('%Y', c_lmon, 'localtime')-strftime('%Y', c_fmon, 'localtime'))*12 as SALE from client where c_grade='silver';

Done.

[('isabell', 120), ('jordan', 240)]

## 테이블 도식화

![query17](./dbimage/query17.jpg)

## 관계 대수식

R1 ← πc_fmon (σc_grade='silver'(client)) <br/>
R2 ← πc_lmon (σc_grade='silver'(client) <br/>
R3 ← R2 - R1

<hr/>

## 질의18. 성별이 'female'인 고객들의 구매 개월 수 * 상품 가격을 검색하라.

In [426]:
%sql select c_name, c_sex, (strftime('%Y', c_lmon, 'localtime')-strftime('%Y', c_fmon, 'localtime'))*12*i_price as SALE_PRICE from client, item where c_sex='female' and c_item = i_no;

Done.

[('catherin', 'female', 3600),
 ('isabell', 'female', 2400),
 ('seyfried', 'female', 7200),
 ('ioniq', 'female', 4800)]

## 테이블 도식화

![query18](./dbimage/query18.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← πi_price (σc_sex='female'(R1)) <br/>
R3 ← πc_lmon (σc_sex='female'(R1)) <br/>
R4 ← πc_lmon (σc_sex='female'(R1)) <br/>
R5 ← R4 - R3 <br/>
R6 ← R2 * R5

<hr/>

## 질의19. 성별이 'male'이고, 등급이 'gold'인 고객들의 구매 개월 수 * 상품 가격을 검색하라.

In [429]:
%sql select c_name, c_sex, c_grade, (strftime('%Y', c_lmon, 'localtime')-strftime('%Y', c_fmon, 'localtime'))*12*i_price as SALE_PRICE from client, item where c_sex='male' and c_item=i_no and c_grade = 'gold';

Done.

[('rick', 'male', 'gold', 9600),
 ('murto', 'male', 'gold', 900),
 ('manson', 'male', 'gold', 11880)]

## 테이블 도식화

![query19](./dbimage/query19.jpg.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← πi_price (σc_sex='male' and c_grade='gold'(R1)) <br/>
R3 ← πc_lmon (σc_sex='male' and c_grade='gold'(R1)) <br/>
R4 ← πc_lmon (σc_sex='male' and c_grade='gold'(R1)) <br/>
R5 ← R4 - R3 <br/>
R6 ← R2 * R5

<hr/>

## 질의20. 상품명중 'v' 가 포함된 상품의 총 매출액(할인값 적용, group by 적용)을 검색하라.

In [438]:
%sql select i_name, (strftime('%Y', c_lmon, 'localtime')-strftime('%Y', c_fmon, 'localtime'))*12*i_price*(1-g_sale) as SALE_PRICE from client, item, grade where i_name like "%_v" and c_item=i_no and c_grade = g_grade group by i_name;

Done.

[('cancer_v', 19656.0),
 ('kid_v', 4464.0),
 ('tooth_v', 11048.4),
 ('total_v', 13104.0),
 ('wound_v', 4914.0)]

## 테이블 도식화

![query20](./dbimage/query20.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← R1⋈(c_grade=g_grade) grade <br/>
R3 ← πi_price (σi_name='%v' (R2)) <br/>
R4 ← πg_sale (R2) <br/>
R5 ← πc_lmon (σi_name='%v' (R1)) <br/>
R6 ← πc_fmon (σi_name='%v' (R1)) <br/>
R7 ← R6 - R5 <br/>
R8 ← R7 * R3 * (1-R2)

<hr/>

## 질의21. 고객이름, 등급할인율, 상품이름, 판매자이름, 판매자 급여를 검색하라. (다중 join)

In [257]:
%sql select c_name as client_name , g_sale as per_sale, i_name as product_name, s_name as saler, s_payment as saler_payment from client, saler, item, grade where g_grade=c_grade and i_no=c_item and s_no=c_saler;

Done.

[('johnson', 0.09, 'total', 'stark', 50000),
 ('catherin', 0.07, 'total_v', 'bradpitt', 30000),
 ('rick', 0.07, 'cancer', 'cambell', 40000),
 ('gordick', 0.09, 'cancer_v', 'gotham', 30000),
 ('isabell', 0.05, 'kid', 'hathaway', 40000),
 ('seyfried', 0.09, 'total_v', 'victor', 30000),
 ('murto', 0.07, 'total', 'meilan', 40000),
 ('glen', 0.09, 'wound', 'lee', 30000),
 ('decaprio', 0.09, 'total_v', 'obama', 50000),
 ('trump', 0.09, 'total_v', 'jang', 50000),
 ('busi', 0.09, 'cancer_v', 'stark', 50000),
 ('ioniq', 0.07, 'kid_v', 'lee', 30000),
 ('messi', 0.09, 'wound_v', 'cambell', 40000),
 ('jordan', 0.05, 'tooth', 'gotham', 30000),
 ('manson', 0.07, 'tooth_v', 'jang', 50000)]

## 테이블 도식화

![query21](./dbimage/query21.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← R1⋈(c_grade=g_grade) grade <br/>
R3 ← R2⋈(c_saler=s_no) saler <br/>
R4 ← πc_name, g_sale, i_name, s_name, s_payment (R3)

<hr/>

## 질의22. 질의21번에서 급여가 39999 이상인 판매자의 이름을 검색하라. (in)

In [13]:
%sql select s_name as saler, s_payment as payment from saler where s_payment in  (select s_payment from client, saler, item, grade where g_grade=c_grade and i_no=c_item and s_no=c_saler and s_payment>39999);

Done.

[('stark', 50000),
 ('cambell', 40000),
 ('jang', 50000),
 ('Hathaway', 40000),
 ('obama', 50000),
 ('meilan', 40000)]

## 테이블 도식화

![query22](./dbimage/query22.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← R1⋈(c_grade=g_grade) grade <br/>
R3 ← R2⋈(c_saler=s_no) saler <br/>
R4 ← πc_name, g_sale, i_name, s_name, s_payment (R3) <br/>
R5 ← πc_name (σs_payment>39999 (R4)) <br/>

<hr/>

## 질의23. 판매자 번호 '100'번대의 사람들이 판매한 고객의 이름을 검색하라. (exists)

In [255]:
%sql select c_name from client c where exists  (select s_no from (select c_name , g_sale, s_no, s_name, s_payment from client, saler, item, grade where g_grade=c_grade and i_no=c_item and s_no=c_saler) as a where a.s_no in (100,101,102,103) and c.c_saler = a.s_no);

Done.

[('johnson',),
 ('rick',),
 ('gordick',),
 ('glen',),
 ('busi',),
 ('ioniq',),
 ('messi',),
 ('jordan',)]

## 테이블 도식화

![query23](./dbimage/query23.jpg)

## 관계 대수식

R1 ← client⋈(c_item=i_no) item <br/>
R2 ← R1⋈(c_grade=g_grade) grade <br/>
R3 ← R2⋈(c_saler=s_no) saler <br/>
R4 ← πc_name, g_sale, i_name, s_name, s_payment (R3) <br/>
R5 ← πc_name (σc_saler<200 (R4))